---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.ElectricalPower
source: html/bf5f3da2-881d-c3a5-6acb-b6e863da8d5a.htm
---
# Autodesk.Revit.DB.SpecTypeId.ElectricalPower Property

Power, in discipline Electrical.

## Syntax (C#)
```csharp
public static ForgeTypeId ElectricalPower { get; }
```